cosmos4343/ESP32S3-MP3Player/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# LVGL configuration
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
CONFIG_LV_USE_LOG=n
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_MEM_SIZE_KB=64

# PSRAM for framebuffer / lvgl buffer
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# FreeRTOS tick rate (keep default for lvgl)
CONFIG_FREERTOS_HZ=100

# 16MB flash (physical chip is 16MB Boya) with custom partition table
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Return FAT filenames as UTF-8 (Chinese filenames render directly in LVGL)
CONFIG_FATFS_API_ENCODING_UTF_8=y

